<?php
// echo "<img src=\"images/\" style=\"width:100px; height:100px;\">";
// <table>
//     <tr><th>Заголовок1</th><th>Заголовок2</th></tr>
//     <tr><td>Текст 1</td><td>Текст 2</td></tr>
//     <tr><td>Текст 3</td><td>Текст 4</td></tr>
// </table>
$n = 10;
$prefix = ["", "недосоленный", "сильный", "славянский", "негожий", "морской" , "закуток", "недоросток", "матросо", "курапат", "убийца", "страшный", "дикий", "небожитель" , "Солнышко", "милый"];
$name = ["", "герасим", "огурец", "савелий", "флюгер", "помидор" , "джефри" , "лавер", "акира", "генадий", "смотритель", "вождь", "диктатор", "мастер", "сугроб" , "спрут"];
$titul = [];
echo "<table>";
echo "<tr><th>номер пользователя</th><th>аватарка</th><th>имя</th></tr>";
for ($i=1; $i < $n; $i++) {
    if($i%2 == 0) {
        continue;
    }
    else {
    echo "<tr>";
    echo "<td>$i</td>";
    echo "<td><img src=\"images/prof$i.png\" style=\"width:100px; height:100px;\"></td>";
    echo "<td>{$prefix[rand(0,15)]} {$name[rand(0,15)]}</td>";
    echo "</tr>";
    }

}
echo "</table>";